### Terraform Plan: `nrds` ✅

**Plan: 30 to add, 0 to change, 29 to destroy.**

<details><summary>Show Plan Details</summary>

```terraform
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst22_forcing_schedule_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 22 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = jsonencode(
                {
                  + Input           = jsonencode(
                        {
                          + commands            = [
                              + "runuser -l ec2-user -c 'mkdir -p /home/ec2-user/run/datastream-metadata'",
                              + "runuser -l ec2-user -c 'mkdir -p /home/ec2-user/run/ngen-run/config'",
                              + "runuser -l ec2-user -c 'cp /home/ec2-user/ngen-datastream/configs/ngen/realization_sloth_nom_cfe_pet.json /home/ec2-user/run'",
                              + "runuser -l ec2-user -c 'docker run --rm -v /home/ec2-user/run:/mounted_dir -u $(id -u):$(id -g) -w /mounted_dir/datastream-metadata awiciroh/datastream:1.0.2 python3 /ngen-datastream/python_tools/src/python_tools/configure_datastream.py --docker_mount /mounted_dir --start_date DAILY --data_dir /home/ec2-user/run --forcing_source NWM_V3_SHORT_RANGE_22 --forcing_split_vpu 01,02,03N,03S,03W,04,05,06,07,08,09,10L,10U,11,12,13,14,15,16,18 --hydrofabric_version v2.2 --realization /mounted_dir/realization_sloth_nom_cfe_pet.json --realization_provided /home/ec2-user/run/realization_sloth_nom_cfe_pet.json --s3_bucket ciroh-community-ngen-datastream --s3_prefix forcings/v2.2_hydrofabric/ngen.DAILY/forcing_short_range/22'",
                              + "runuser -l ec2-user -c 'docker run --rm -v /home/ec2-user/run:/mounted_dir -u $(id -u):$(id -g) -w /mounted_dir/datastream-metadata awiciroh/forcingprocessor:1.0.3 python3 /ngen-datastream/forcingprocessor/src/forcingprocessor/nwm_filenames_generator.py /mounted_dir/datastream-metadata/conf_nwmurl.json'",
                              + "runuser -l ec2-user -c 'cp /home/ec2-user/hydrofabric/v2.2/nextgen_*_weights.json /home/ec2-user/run'",
                              + "runuser -l ec2-user -c 'docker run --rm -e AWS_ACCESS_KEY_ID=$(echo $AWS_ACCESS_KEY_ID) -e AWS_SECRET_ACCESS_KEY=$(echo $AWS_SECRET_ACCESS_KEY) -v /home/ec2-user/run:/mounted_dir -u $(id -u):$(id -g) -w /mounted_dir/datastream-metadata awiciroh/forcingprocessor:1.0.3 python3 /ngen-datastream/forcingprocessor/src/forcingprocessor/processor.py /mounted_dir/datastream-metadata/conf_fp.json'",
                              + "runuser -l ec2-user -c 'aws s3 cp /home/ec2-user/run/datastream-metadata/conf_nwmurl.json $(cat /home/ec2-user/run/datastream-metadata/conf_fp.json | jq -r '.storage.output_path')/metadata/forcings_metadata/conf_nwmurl.json --no-progress'",
                            ]
                          + instance_parameters = {
                              + BlockDeviceMappings = [
                                  + {
                                      + DeviceName = "/dev/xvda"
                                      + Ebs        = {
                                          + VolumeSize = 64
                                          + VolumeType = "gp3"
                                        }
                                    },
                                ]
                              + IamInstanceProfile  = {
                                  + Name = "nrds_prod_ec2_profile"
                                }
                              + ImageId             = "ami-062245e1c9604128d"
                              + InstanceType        = "m8g.2xlarge"
                              + TagSpecifications   = [
                                  + {
                                      + ResourceType = "instance"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_forcing_short_range_init22"
                                            },
                                          + {
                                              + Key   = "Project"
                                              + Value = "forcing_FULLCONUS_v1.2_short_range"
                                            },
                                        ]
                                    },
                                  + {
                                      + ResourceType = "volume"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_forcing_short_range_init22_vol"
                                            },
                                        ]
                                    },
                                ]
                            }
                          + run_options         = {
                              + ii_cheapo             = true
                              + ii_check_s3           = true
                              + ii_delete_volume      = true
                              + ii_terminate_instance = true
                              + n_retries_allowed     = 2
                              + timeout_s             = 3600
                            }
                        }
                    )
                  + Name            = "forcing_short_range_init22_<aws.scheduler.execution-id>"
                  + StateMachineArn = "arn:aws:states:us-east-1:879381264451:stateMachine:nrds_prod_sm"
                }
            )
          + role_arn = "arn:aws:iam::879381264451:role/nrds_prod_scheduler_role"
        }
    }

  # module.forcing_schedules.aws_scheduler_schedule.datastream_schedule_short_range_forcing["23"] will be created
  + resource "aws_scheduler_schedule" "datastream_schedule_short_range_forcing" {
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "short_range_fcst23_forcing_schedule_prod"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 23 * * ? *)"
      + schedule_expression_timezone = "America/New_York"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:sfn:startExecution"
          + input    = jsonencode(
                {
                  + Input           = jsonencode(
                        {
                          + commands            = [
                              + "runuser -l ec2-user -c 'mkdir -p /home/ec2-user/run/datastream-metadata'",
                              + "runuser -l ec2-user -c 'mkdir -p /home/ec2-user/run/ngen-run/config'",
                              + "runuser -l ec2-user -c 'cp /home/ec2-user/ngen-datastream/configs/ngen/realization_sloth_nom_cfe_pet.json /home/ec2-user/run'",
                              + "runuser -l ec2-user -c 'docker run --rm -v /home/ec2-user/run:/mounted_dir -u $(id -u):$(id -g) -w /mounted_dir/datastream-metadata awiciroh/datastream:1.0.2 python3 /ngen-datastream/python_tools/src/python_tools/configure_datastream.py --docker_mount /mounted_dir --start_date DAILY --data_dir /home/ec2-user/run --forcing_source NWM_V3_SHORT_RANGE_23 --forcing_split_vpu 01,02,03N,03S,03W,04,05,06,07,08,09,10L,10U,11,12,13,14,15,16,18 --hydrofabric_version v2.2 --realization /mounted_dir/realization_sloth_nom_cfe_pet.json --realization_provided /home/ec2-user/run/realization_sloth_nom_cfe_pet.json --s3_bucket ciroh-community-ngen-datastream --s3_prefix forcings/v2.2_hydrofabric/ngen.DAILY/forcing_short_range/23'",
                              + "runuser -l ec2-user -c 'docker run --rm -v /home/ec2-user/run:/mounted_dir -u $(id -u):$(id -g) -w /mounted_dir/datastream-metadata awiciroh/forcingprocessor:1.0.3 python3 /ngen-datastream/forcingprocessor/src/forcingprocessor/nwm_filenames_generator.py /mounted_dir/datastream-metadata/conf_nwmurl.json'",
                              + "runuser -l ec2-user -c 'cp /home/ec2-user/hydrofabric/v2.2/nextgen_*_weights.json /home/ec2-user/run'",
                              + "runuser -l ec2-user -c 'docker run --rm -e AWS_ACCESS_KEY_ID=$(echo $AWS_ACCESS_KEY_ID) -e AWS_SECRET_ACCESS_KEY=$(echo $AWS_SECRET_ACCESS_KEY) -v /home/ec2-user/run:/mounted_dir -u $(id -u):$(id -g) -w /mounted_dir/datastream-metadata awiciroh/forcingprocessor:1.0.3 python3 /ngen-datastream/forcingprocessor/src/forcingprocessor/processor.py /mounted_dir/datastream-metadata/conf_fp.json'",
                              + "runuser -l ec2-user -c 'aws s3 cp /home/ec2-user/run/datastream-metadata/conf_nwmurl.json $(cat /home/ec2-user/run/datastream-metadata/conf_fp.json | jq -r '.storage.output_path')/metadata/forcings_metadata/conf_nwmurl.json --no-progress'",
                            ]
                          + instance_parameters = {
                              + BlockDeviceMappings = [
                                  + {
                                      + DeviceName = "/dev/xvda"
                                      + Ebs        = {
                                          + VolumeSize = 64
                                          + VolumeType = "gp3"
                                        }
                                    },
                                ]
                              + IamInstanceProfile  = {
                                  + Name = "nrds_prod_ec2_profile"
                                }
                              + ImageId             = "ami-062245e1c9604128d"
                              + InstanceType        = "m8g.2xlarge"
                              + TagSpecifications   = [
                                  + {
                                      + ResourceType = "instance"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_forcing_short_range_init23"
                                            },
                                          + {
                                              + Key   = "Project"
                                              + Value = "forcing_FULLCONUS_v1.2_short_range"
                                            },
                                        ]
                                    },
                                  + {
                                      + ResourceType = "volume"
                                      + Tags         = [
                                          + {
                                              + Key   = "Name"
                                              + Value = "prod_forcing_short_range_init23_vol"
                                            },
                                        ]
                                    },
                                ]
                            }
                          + run_options         = {
                              + ii_cheapo             = true
                              + ii_check_s3           = true
                              + ii_delete_volume      = true
                              + ii_terminate_instance = true
                              + n_retries_allowed     = 2
                              + timeout_s             = 3600
                            }
                        }
                    )
                  + Name            = "forcing_short_range_init23_<aws.scheduler.execution-id>"
                  + StateMachineArn = "arn:aws:states:us-east-1:879381264451:stateMachine:nrds_prod_sm"
                }
            )
          + role_arn = "arn:aws:iam::879381264451:role/nrds_prod_scheduler_role"
        }
    }

  # module.nrds_orchestration.local_file.write_arn will be created
  + resource "local_file" "write_arn" {
      + content              = "arn:aws:states:us-east-1:879381264451:stateMachine:nrds_prod_sm"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../modules/orchestration/sm_ARN.txt"
      + id                   = (known after apply)
    }

Plan: 30 to add, 0 to change, 29 to destroy.

Changes to Outputs:
  ~ cfe_nom_analysis_assim_schedule_count   = 21 -> 20
  ~ cfe_nom_medium_range_schedule_count     = 84 -> 80
  ~ cfe_nom_short_range_schedule_count      = 504 -> 480
  + forcing_analysis_assim_schedule_count   = 1
  + forcing_medium_range_schedule_count     = 4
  + forcing_short_range_schedule_count      = 24

```

</details>

*Pusher: @harshavemula-ua, Action: `pull_request`, Workflow: `Terraform PR Validation`*